def income_report(df, c18_data, c19_data):
    e5 = df['당월정액상각대상수령액'].sum()
    c5 = e5
    c8 = df['당월수익인식액'].sum()
    e8 = c8
    e11 = df['당기환수수익조정'].sum()
    c11 = e11
    c14 = df['기타조정액'].sum()
    e14 = c14
    c18 = c18_data
    c19 = c19_data
    d23 = c18 + c5 - e8 + c14
    e23 = df['기말선수수익'].sum()
    f23 = d23 - e23
    d24 = c19 + c11
    e24 = df['기말환수부채'].sum()
    f24 = d24 - e24
    return {
        'e5': e5, 'c5': c5, 'c8': c8, 'e8': e8, 'e11': e11, 'c11': c11,
        'c14': c14, 'e14': e14, 'c18': c18, 'c19': c19, 'd23': d23,
        'e23': e23, 'f23': f23, 'd24': d24, 'e24': e24, 'f24': f24
    }  


def expense_report(df, c18_data, c19_data):
    e5 = df['당월정액상각대상수지급액'].sum()
    c5 = e5
    c8 = df['당월비용인식액'].sum()
    e8 = c8
    e11 = df['당기환수비용조정'].sum()
    c11 = e11
    c14 = df['기타조정액'].sum()
    e14 = c14
    c18 = c18_data
    c19 = c19_data
    d23 = c18 + c5 - e8 + c14
    e23 = df['기말선급비용'].sum()
    f23 = d23 - e23
    d24 = c19 + c11
    e24 = df['기말환수자산'].sum()
    f24 = d24 - e24
    return {
        'e5': e5, 'c5': c5, 'c8': c8, 'e8': e8, 'e11': e11, 'c11': c11,
        'c14': c14, 'e14': e14, 'c18': c18, 'c19': c19, 'd23': d23,
        'e23': e23, 'f23': f23, 'd24': d24, 'e24': e24, 'f24': f24
    }

def policy_income_report(df, c_32,c_33,c_34,c_35):
    c_6 = df['시책수령액(당월)'].sum()+ df['시책수령환수액(당월)'].sum()
    
    e_6 = c_6
    c_9 = df['당월수익인식액'].sum()
    e_9 = c_9
    c_12 = df['당기환수수익조정'].sum()
    e_12 = c_12
    c_15 = df['선수수익 기타조정액'].sum()
    e_15 = c_15
    c_19 = df['시책지급액(당월)'].sum()+df['시책지급환수액(당월)'].sum()
    e_19 = c_19
    c_22 = df['당월비용인식액'].sum()
    e_22 = c_22
    c_25 = df['당기환수비용조정'].sum()
    e_25 = c_25
    c_28 = df['선급비용 기타조정액'].sum()
    e_28 = c_28

    c_38 = c_32 + e_6 - c_9 + e_15
    c_39 = c_33+c_19-e_22+c_28
    c_40 = c_34+e_12
    c_41 = c_35+c_25
    d_38 = df['기말선수수익'].sum()
    d_39 = df['기말선급비용'].sum()
    d_40 = df['기말환수부채'].sum()
    d_41 = df['기말환수자산'].sum()
    e_38 = c_38-d_38
    e_39 = c_39-d_39
    e_40 = c_40-d_40
    e_41 = c_41-d_41
    
    return {'c_6':c_6,'e_6':e_6,'c_9':c_9,'e_9':e_9,'c_12':c_12,
               'e_12':e_12,'c_15':c_15,'e_15':e_15,'c_19':c_19,
               'e_19':e_19,'c_22':c_22,'e_22':e_22,
               'c_25':c_25, 'e_25':e_25, 'c_28':c_28, 'e_28':e_28, 
               'c_32':c_32, 'c_33':c_33, 'c_34':c_34, 'c_35':c_35,
               'c_38':c_38,'c_39':c_39,'e_38':e_38,'d_38':d_38,'e_39':e_39
               ,'d_39':d_39,'d_40':d_40,'c_40':c_40,'e_40':e_40, 
               'd_41':d_41,'c_41':c_41,'e_41':e_41}
    