import pandas as pd

def policy_sample_data(sample_name):
    # Define sample data based on the requested sample
    if sample_name == 'inc_p_comission':
        data = {
            '보험사': ['흥국생명', '흥국생명', '흥국생명'],
            '업적월': ['202307', '202308', '202309'],
            '시책계산방식': ['1차년도', '1차년도', '1차년도'],
            '전속(직영)/전략(지사)': ['지사&직영', '지사&직영', '지사&직영'],
            '기시기말숫자코드': ['흥국생명/202307/1차년도', '흥국생명/202308/1차년도', '흥국생명/202309/1차년도'],
            '환수율적용회차': [12, 12, 12],
            1: ['100', '100', '100'],
            2: ['95', '95', '95'],
            3: ['90', '90', '90'],
            4: ['80', '80', '80'],
            5: ['70', '70', '70'],
            6: ['60', '60', '60'],
            7: ['55', '55', '55'],
            8: ['50', '50', '50'],
            9: ['40', '40', '40'],
            10: ['30', '30', '30'],
            11: ['20', '20', '20'],
            12: ['10', '10', '10'],
            13: [None, None, None],
            14: [None, None, None],
            15: [None, None, None],
            16: [None, None, None],
            17: [None, None, None],
            18: [None, None, None],
            19: [None, None, None],
            20: [None, None, None],
            21: [None, None, None],
            22: [None, None, None],
            23: [None, None, None],
            24: [None, None, None]
        }
    elif sample_name =='inc_p_retention':
        data = {
    '회사명': ['흥국생명', '흥국화재', '한화손보'],
    '구분': ['생보평균', '손보평균', '손보평균'],
    0: ['100', '100', '100'],
    1: ['99', '99', '99'],
    2: ['98', '98', '98'],
    3: ['97', '97', '97'],
    4: ['96', '95', '95'],
    5: ['94', '94', '94'],
    6: ['93', '93', '93'],
    7: ['92', '92', '92'],
    8: ['91', '91', '91'],
    9: ['90', '90', '90'],
    10: ['89', '89', '89'],
    11: ['88', '87', '87'],
    12: ['87', '86', '86'],
    13: ['85', '85', '85'],
    14: ['84', '84', '84'],
    15: ['83', '83', '83'],
    16: ['81', '82', '82'],
    17: ['80', '81', '81'],
    18: ['79', '81', '81'],
    19: ['77', '80', '80'],
    20: ['76', '79', '79'],
    21: ['75', '78', '78'],
    22: ['73', '77', '77'],
    23: ['72', '76', '76'],
    24: ['71', '75', '75'],
    25: ['69', '74', '74']
}

    elif sample_name == 'inc_p_data_case':
        data = {
    '사용인번호': [1020230408, 1020230214, 1020230748],
    '보험사대분류': ['생보', '생보', '생보'],
    '보험사': ['흥국생명', '흥국생명', '흥국생명'],
    '증권번호': ['0208332100021', '0597905100012', '1001315200124'],
    '시책유형': ['현금', '현금', '현금'],
    '업적시작월': [202406, 202406, 202406],
    '업적종료월': [202406, 202406, 202406],
    '내용구분': ['사용인환수', '사용인환수', '사용인환수'],
    '내용': ['시책 착오 산출분(할인전보험료 산출 오류) 환수', '시책 착오 산출분(할인전보험료 산출 오류) 환수', '시책 착오 산출분(할인전보험료 산출 오류) 환수'],
    '기준금액': [-4297, -2305, -7000],
    '지급율(%)_1': [130, 130, 130],
    '금액_1': [-5586.0, -2997.0, -9100.0],
    '지급횟차': [1, 1, 1],
    '기준금액_2': [-4297, -2305, -7000],
    '지급율(%)_2': [200, 200, 200],
    '금액_2': [-8594.0, -4610.0, -14000.0],
    '지원성 시책 여부': ['Y', 'Y', 'Y'],
    '당사명세서반영여부': ['Y', 'Y', 'Y'],
    '이행보증가입여부': ['Y', 'Y', 'Y'],
    '업적년월': [202407, 202407, 202407],
    '시책구분': ['1차년도', '1차년도', '1차년도'],
    '채널': ['전속', '전속', '전속']
}
    elif sample_name == 'inc_p_prev_month':
        data = {
    '보험사+업적월+시책회차 key': ['흥국화재/202306/1차년도', 'KB라이프/202307/1차년도', '현대해상/202307/1차년도'],
    '마감월': [202407, 202407, 202407],
    '보험사': ['흥국화재', 'KB라이프', '현대해상'],
    '업적월': [202306, 202307, 202307],
    '시책계산방식': ['1차년도', '1차년도', '1차년도'],
    '당기해당회차': [14, 13, 13],
    '수익비용인식회차': [None, 5, 12],
    '환수율': ['0%', '0%', '0%'],
    '유지율': ['84%', '85%', '85%'],
    '시책수령액(당월)': [None, None, None],
    '시책수령환수액(당월)': [None, None, None],
    '시책수령액(누적)': [None, '345,888,790', '10,804,000'],
    '시책수령환수액(누적)': ['(966,610)', '(7,513,220)', '(1,223,168)'],
    '시책지급액(당월)': [None, None, None],
    '시책지급환수액(당월)': [None, None, None],
    '시책지급액(누적)': [None, '278,302,559', '5,694,300'],
    '시책지급환수액(누적)': ['(1,231,760)', '(6,209,050)', '(399,945)'],
    '기초선수수익': [None, None, None],
    '당월시책수령액': [None, None, None],
    '당월시책수령환수액': ['(966,610)', '338,375,570', '9,580,832'],
    '당월누적수익인식액': ['(966,610)', '338,375,570', '9,580,832'],
    '전월누적수익인식액': [None, None, None],
    '당월수익인식액': [None, None, None],
    '선수수익 기타조정액': [None, None, None],
    '기말선수수익': [None, None, None],
    '기초선급비용': [None, None, None],
    '당월시책지급액': [None, '272,093,509', '5,294,355'],
    '당월시책지급환수액': ['(1,231,760)', '272,093,509', '5,294,355'],
    '당월누적비용인식액': [None, None, None],
    '전월누적비용인식액': [None, None, None],
    '당월비용인식액': [None, None, None],
    '선급비용 기타조정액': [None, None, None],
   
    '기말선급비용':[None, None, None],
    '기초환수부채': [None, None, None],
    '당기환수수익조정': [None, None, None],
    '기말환수부채': [None, None, None],
    '기초환수자산': [None, None, None],
    '당기환수비용조정': [None, None, None],
    '기말환수자산': [None, None, None]
}
    elif sample_name == 'inc_p_main':
        data = {
    '보험사+업적월+시책회차 key': ['흥국화재/202306/1차년도', 'KB라이프/202307/1차년도', '현대해상/202307/1차년도'],
    '마감월': [202407, 202407, 202407],
    '보험사': ['흥국화재', 'KB라이프', '현대해상']
}

    df = pd.DataFrame(data)
    return df